In [15]:
# Testing the connection first

import pymysql as pms
import pandas as pd
from sqlalchemy import create_engine


CONSTRING = 'mysql+mysqlconnector://root:42069@127.0.0.1:3306/md_water_services'
ENGINE = create_engine(CONSTRING)

# Check for connection.
if(CONSTRING):
    print("Successfully connected")
else:
    print("Connection failed:(")

Successfully connected

In [2]:
df = pd.read_sql_query("SELECT * FROM data_dictionary LIMIT 10", ENGINE)
df

,table_name,column_name,description,datatype,related_to
0,employee,assigned_employee_id,Unique ID assigned to each employee,INT,visits
1,employee,employee_name,Name of the employee,VARCHAR(255),
2,employee,phone_number,Contact number of the employee,VARCHAR(15),
3,employee,email,Email address of the employee,VARCHAR(255),
4,employee,address,Residential address of the employee,VARCHAR(255),
5,employee,town_name,Name of the town where the employee resides,VARCHAR(255),
6,employee,province_name,Name of the province where the employee resides,VARCHAR(255),
7,employee,position,Position or job title of the employee,VARCHAR(255),
8,visits,record_id,Unique ID assigned to each visit,int,"water_quality, water_source"
9,visits,location_id,ID of the location visited,varchar(255),location

In [3]:
dfA = pd.read_sql_query("SELECT * FROM employee LIMIT 10", ENGINE)
dfA

,assigned_employee_id,employee_name,phone_number,email,address,province_name,town_name,position
0,0,Amara Jengo,+99637993287,None,36 Pwani Mchangani Road,Sokoto,Ilanga,Field Surveyor
1,1,Bello Azibo,+99643864786,None,129 Ziwa La Kioo Road,Kilimani,Rural,Field Surveyor
2,2,Bakari Iniko,+99222599041,None,18 Mlima Tazama Avenue,Hawassa,Rural,Field Surveyor
3,3,Malachi Mavuso,+99945849900,None,100 Mogadishu Road,Akatsi,Lusaka,Field Surveyor
4,4,Cheche Buhle,+99381679640,None,1 Savanna Street,Akatsi,Rural,Field Surveyor
5,5,Zuriel Matembo,+99034075111,None,26 Bahari Ya Faraja Road,Kilimani,Rural,Field Surveyor
6,6,Deka Osumare,+99379364631,None,104 Kenyatta Street,Akatsi,Rural,Field Surveyor
7,7,Lalitha Kaburi,+99681623240,None,145 Sungura Amanpour Road,Kilimani,Rural,Field Surveyor
8,8,Enitan Zuri,+99248509202,None,117 Kampala Road,Hawassa,Zanzibar,Field Surveyor
9,10,Farai Nia,+99570082739,None,33 Angélique Kidjo Avenue,Amanzi,Dahabu,Field Surveyor

In [4]:
dfB = pd.read_sql_query("SELECT * FROM global_water_access LIMIT 10", ENGINE)
dfB

,name,region,year,pop_n,pop_u,wat_bas_n,wat_lim_n,wat_unimp_n,wat_sur_n,wat_bas_r,wat_lim_r,wat_unimp_r,wat_sur_r,wat_bas_u,wat_lim_u,wat_unimp_u,wat_sur_u
0,Afghanistan,South Asia,2015,34413.600,24.803,61.3398,3.51120,22.168800,12.980200,52.9885,3.86114,26.553300,16.597100,86.6589,2.45027,8.876040,2.014750
1,Afghanistan,South Asia,2020,38928.300,26.026,75.0914,1.44754,14.560300,8.900780,66.3279,1.95682,19.682900,12.032300,100.0000,0.00000,0.000000,0.000000
2,Albania,Europe & Central Asia,2015,2890.520,57.434,93.3943,3.62638,2.979290,0.000000,90.6273,5.26317,4.109550,0.000000,95.4451,2.41331,2.141620,0.000000
3,Albania,Europe & Central Asia,2020,2877.800,62.112,95.0680,1.88466,3.047310,0.000000,94.0914,2.30526,3.603380,0.000000,95.6638,1.62809,2.708100,0.000000
4,Algeria,Middle East & North Africa,2015,39728.000,70.848,93.4096,5.15778,1.275460,0.157193,88.3527,8.68575,2.580430,0.381108,95.4903,3.70612,0.738510,0.065058
5,Algeria,Middle East & North Africa,2020,43851.000,73.733,94.4373,4.98588,0.531837,0.044952,90.0375,8.79672,0.994603,0.171137,96.0047,3.62829,0.366976,0.000000
6,American Samoa,East Asia & Pacific,2015,55.806,87.238,99.6191,0.00000,0.380897,0.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
7,American Samoa,East Asia & Pacific,2020,55.197,87.153,99.7738,0.00000,0.226228,0.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
8,Andorra,Europe & Central Asia,2015,77.993,88.345,100.0000,0.00000,0.000002,0.000000,100.0000,0.00000,0.000000,0.000000,100.0000,0.00000,0.000000,0.000000
9,Andorra,Europe & Central Asia,2020,77.265,87.916,100.0000,0.00000,0.000000,0.000000,100.0000,0.00000,0.000000,0.000000,100.0000,0.00000,0.000000,0.000000

In [5]:
dfC = pd.read_sql_query("SELECT * FROM location LIMIT 10", ENGINE)
dfC

  location_id               address province_name town_name location_type
0   AkHa00000    2 Addis Ababa Road        Akatsi    Harare         Urban
1   AkHa00001   10 Addis Ababa Road        Akatsi    Harare         Urban
2   AkHa00002    9 Addis Ababa Road        Akatsi    Harare         Urban
3   AkHa00003  139 Addis Ababa Road        Akatsi    Harare         Urban
4   AkHa00004   17 Addis Ababa Road        Akatsi    Harare         Urban
5   AkHa00005  125 Addis Ababa Road        Akatsi    Harare         Urban
6   AkHa00006   98 Addis Ababa Road        Akatsi    Harare         Urban
7   AkHa00007   21 Addis Ababa Road        Akatsi    Harare         Urban
8   AkHa00008   11 Addis Ababa Road        Akatsi    Harare         Urban
9   AkHa00009    6 Addis Ababa Road        Akatsi    Harare         Urban

In [6]:
dfD = pd.read_sql_query("SELECT * FROM visits LIMIT 10", ENGINE)
dfD

,record_id,location_id,source_id,time_of_record,visit_count,time_in_queue,assigned_employee_id
0,0,SoIl32582,SoIl32582224,2021-01-01 09:10:00,1,15,12
1,1,KiRu28935,KiRu28935224,2021-01-01 09:17:00,1,0,46
2,2,HaRu19752,HaRu19752224,2021-01-01 09:36:00,1,62,40
3,3,AkLu01628,AkLu01628224,2021-01-01 09:53:00,1,0,1
4,4,AkRu03357,AkRu03357224,2021-01-01 10:11:00,1,28,14
5,5,KiRu29315,KiRu29315224,2021-01-01 10:17:00,1,9,40
6,6,AkRu05234,AkRu05234224,2021-01-01 10:18:00,1,0,30
7,7,KiRu28520,KiRu28520224,2021-01-01 10:28:00,1,0,34
8,8,HaZa21742,HaZa21742224,2021-01-01 10:37:00,1,0,6
9,9,AmDa12214,AmDa12214224,2021-01-01 10:58:00,1,0,36

In [7]:
dfE = pd.read_sql_query("SELECT * FROM water_quality LIMIT 10", ENGINE)
dfE

   record_id  subjective_quality_score  visit_count
0          0                         0            1
1          1                         1            1
2          2                         5            1
3          3                        10            1
4          4                         4            1
5          5                         0            1
6          6                         9            1
7          7                        10            1
8          8                         2            1
9          9                        10            1

In [8]:
dfF = pd.read_sql_query("SELECT * FROM water_source LIMIT 10", ENGINE)
dfF

      source_id type_of_water_source  number_of_people_served
0  AkHa00000224          tap_in_home                      956
1  AkHa00001224   tap_in_home_broken                      930
2  AkHa00002224   tap_in_home_broken                      486
3  AkHa00003224                 well                      364
4  AkHa00004224   tap_in_home_broken                      942
5  AkHa00005224          tap_in_home                      736
6  AkHa00006224          tap_in_home                      882
7  AkHa00007224          tap_in_home                      554
8  AkHa00008224                 well                      398
9  AkHa00009224                 well                      346

In [9]:
dfG = pd.read_sql_query("SELECT * FROM well_pollution LIMIT 10", ENGINE)
dfG

,source_id,date,description,pollutant_ppm,biological,results
0,KiRu28935224,2021-01-04 09:17:00,Bacteria: Giardia Lamblia,0.000000,495.898000,Contaminated: Biological
1,AkLu01628224,2021-01-04 09:53:00,Bacteria: E. coli,0.000000,6.096080,Contaminated: Biological
2,HaZa21742224,2021-01-04 10:37:00,"Inorganic contaminants: Zinc, Zinc, Lead, Cadmium",2.715000,0.000000,Contaminated: Chemical
3,HaRu19725224,2021-01-04 11:04:00,Clean,0.028859,0.000096,Clean
4,SoRu35703224,2021-01-04 11:29:00,Bacteria: E. coli,0.000000,22.500900,Contaminated: Biological
5,AkHa00070224,2021-01-04 11:42:00,Inorganic contaminants: Cadmium,5.467390,0.000000,Contaminated: Chemical
6,HaSe21346224,2021-01-04 11:52:00,Clean,0.014038,0.000090,Clean
7,HaYa21468224,2021-01-04 12:03:00,"Inorganic contaminants: Chromium, Barium, Chro...",6.051370,0.000000,Contaminated: Chemical
8,SoRu36278224,2021-01-04 12:24:00,Parasite: Cryptosporidium,0.000000,485.162000,Contaminated: Biological
9,AkLu02155224,2021-01-04 12:29:00,"Inorganic contaminants: Selenium, Arsenic",7.641060,0.000000,Contaminated: Chemical

In [25]:
df_1 = pd.read_sql_query("SELECT source_id, type_of_water_source AS Type, number_of_people_served AS Population FROM water_source LIMIT 5", ENGINE)
df_1

      source_id                Type  Population
0  AkHa00000224         tap_in_home         956
1  AkHa00001224  tap_in_home_broken         930
2  AkHa00002224  tap_in_home_broken         486
3  AkHa00003224                well         364
4  AkHa00004224  tap_in_home_broken         942

In [16]:
df_2 = pd.read_sql_query("SELECT DISTINCT type_of_water_source FROM water_source", ENGINE)
df_2

  type_of_water_source
0          tap_in_home
1   tap_in_home_broken
2                 well
3           shared_tap
4                river

In [17]:
df_2 = pd.read_sql_query("SELECT type_of_water_source, COUNT(type_of_water_source) FROM water_source GROUP BY type_of_water_source", ENGINE)
df_2

  type_of_water_source  COUNT(type_of_water_source)
0          tap_in_home                         7265
1   tap_in_home_broken                         5856
2                 well                        17383
3           shared_tap                         5767
4                river                         3379

In [28]:
visits = pd.read_sql_query("SELECT * FROM visits WHERE time_in_queue > 500 LIMIT 10", ENGINE)
visits

,record_id,location_id,source_id,time_of_record,visit_count,time_in_queue,assigned_employee_id
0,899,SoRu35083,SoRu35083224,2021-01-16 10:14:00,6,515,28
1,2304,SoKo33124,SoKo33124224,2021-02-06 07:53:00,5,512,16
2,2315,KiRu26095,KiRu26095224,2021-02-06 14:32:00,3,529,8
3,3206,SoRu38776,SoRu38776224,2021-02-20 15:03:00,5,509,46
4,3701,HaRu19601,HaRu19601224,2021-02-27 12:53:00,3,504,0
5,4154,SoRu38869,SoRu38869224,2021-03-06 10:44:00,2,533,24
6,5483,AmRu14089,AmRu14089224,2021-03-27 18:15:00,4,509,12
7,9177,SoRu37635,SoRu37635224,2021-05-22 18:48:00,2,515,1
8,9648,SoRu36096,SoRu36096224,2021-05-29 11:24:00,2,533,3
9,11631,AkKi00881,AkKi00881224,2021-06-26 06:15:00,6,502,32

In [29]:
df_2 = pd.read_sql_query("SELECT * FROM water_source WHERE source_id = 'AkRu05234224' OR source_id = 'HaZa21742224'", ENGINE)
df_2

      source_id type_of_water_source  number_of_people_served
0  AkRu05234224   tap_in_home_broken                      496
1  HaZa21742224                 well                      308

In [30]:
quality_score = pd.read_sql_query("SELECT * FROM water_quality WHERE subjective_quality_score = 10 AND visit_count = 2", ENGINE)
quality_score

     record_id  subjective_quality_score  visit_count
0           59                        10            2
1          137                        10            2
2          269                        10            2
3          363                        10            2
4          378                        10            2
..         ...                       ...          ...
213      57522                        10            2
214      58664                        10            2
215      58728                        10            2
216      59733                        10            2
217      59779                        10            2

[218 rows x 3 columns]

In [31]:
df_4 = pd.read_sql_query("SELECT * FROM well_pollution WHERE results = 'Contaminated: Biological' OR results = 'dirty' LIMIT 5", ENGINE)
df_4

,source_id,date,description,pollutant_ppm,biological,results
0,KiRu28935224,2021-01-04 09:17:00,Bacteria: Giardia Lamblia,0.0,495.89800,Contaminated: Biological
1,AkLu01628224,2021-01-04 09:53:00,Bacteria: E. coli,0.0,6.09608,Contaminated: Biological
2,SoRu35703224,2021-01-04 11:29:00,Bacteria: E. coli,0.0,22.50090,Contaminated: Biological
3,SoRu36278224,2021-01-04 12:24:00,Parasite: Cryptosporidium,0.0,485.16200,Contaminated: Biological
4,SoRu36313224,2021-01-04 13:46:00,Bacteria: Vibrio cholerae,0.0,182.88000,Contaminated: Biological

In [33]:
df_4 = pd.read_sql_query("SELECT * FROM well_pollution WHERE results = 'Clean' AND biological > 0.01 LIMIT 10", ENGINE)
df_4

,source_id,date,description,pollutant_ppm,biological,results
0,AkRu08936224,2021-01-08 09:22:00,Bacteria: E. coli,0.040646,35.0068,Clean
1,AkRu06489224,2021-01-10 09:44:00,Clean Bacteria: Giardia Lamblia,0.089790,38.4670,Clean
2,SoRu38011224,2021-01-14 15:35:00,Bacteria: E. coli,0.042509,19.2897,Clean
3,AkKi00955224,2021-01-22 12:47:00,Bacteria: E. coli,0.081209,40.2273,Clean
4,KiHa22929224,2021-02-06 13:54:00,Bacteria: E. coli,0.072254,18.4482,Clean
5,KiRu25473224,2021-02-07 15:51:00,Clean Bacteria: Giardia Lamblia,0.063009,24.4536,Clean
6,HaRu17401224,2021-03-01 13:44:00,Clean Bacteria: Giardia Lamblia,0.064921,25.8129,Clean
7,AkRu07137224,2021-03-04 13:41:00,Clean Bacteria: Giardia Lamblia,0.065684,18.2978,Clean
8,KiRu27205224,2021-03-13 14:17:00,Clean Bacteria: Giardia Lamblia,0.041802,49.4281,Clean
9,AkLu02307224,2021-03-13 15:41:00,Bacteria: E. coli,0.070968,35.2030,Clean

In [35]:
df_4 = pd.read_sql_query("SELECT * FROM well_pollution WHERE description LIKE 'Clean%' AND biological > 0.01", ENGINE)
df_4

,source_id,date,description,pollutant_ppm,biological,results
0,AkRu06489224,2021-01-10 09:44:00,Clean Bacteria: Giardia Lamblia,0.089790,38.467000,Clean
1,KiRu25473224,2021-02-07 15:51:00,Clean Bacteria: Giardia Lamblia,0.063009,24.453600,Clean
2,HaRu17401224,2021-03-01 13:44:00,Clean Bacteria: Giardia Lamblia,0.064921,25.812900,Clean
3,AkRu07137224,2021-03-04 13:41:00,Clean Bacteria: Giardia Lamblia,0.065684,18.297800,Clean
4,KiRu27205224,2021-03-13 14:17:00,Clean Bacteria: Giardia Lamblia,0.041802,49.428100,Clean
5,AkHa00514224,2021-04-11 12:11:00,Clean Bacteria: Giardia Lamblia,0.030540,22.025500,Clean
6,AmAm09776224,2021-05-23 11:28:00,Clean Bacteria: Giardia Lamblia,0.096382,13.657400,Clean
7,SoIl32894224,2021-07-11 11:37:00,Clean Bacteria: Giardia Lamblia,0.071241,5.449570,Clean
8,AkRu07366224,2021-07-23 11:19:00,Clean Bacteria: Giardia Lamblia,0.096946,26.030800,Clean
9,KiHa23443224,2021-09-05 12:34:00,Clean Bacteria: Giardia Lamblia,0.082800,13.716200,Clean
10,AkRu06340224,2021-11-01 15:24:00,Clean Bacteria: Giardia Lamblia,0.051746,36.459400,Clean
11,AkRu06363224,2021-11-15 13:36:00,Clean Bacteria: Giardia Lamblia,0.088216,45.373100,Clean
12,AkRu08749224,2021-11-19 13:37:00,Clean Bacteria: E. coli,0.088819,9.280850,Clean
13,AkRu07066224,2021-12-10 14:40:00,Clean Bacteria: E. coli,0.015104,44.465200,Clean
14,KiAm21996224,2021-12-16 10:05:00,Clean Bacteria: E. coli,0.048042,25.417400,Clean
15,AkRu05377224,2022-01-01 10:53:00,Clean Bacteria: E. coli,0.022661,0.613503,Clean
16,HaRu20765224,2022-02-07 12:39:00,Clean Bacteria: E. coli,0.021383,6.957780,Clean
17,SoMa34473224,2022-03-10 09:01:00,Clean Bacteria: E. coli,0.074578,13.645800,Clean
18,SoKo33474224,2022-03-20 16:07:00,Clean Bacteria: E. coli,0.068718,10.571200,Clean
19,AkHa00226224,2022-03-26 11:53:00,Clean Bacteria: E. coli,0.042457,39.497800,Clean
20,AkRu06881224,2022-03-28 13:37:00,Clean Bacteria: E. coli,0.020283,33.069200,Clean
21,AkLu02254224,2022-04-25 12:51:00,Clean Bacteria: E. coli,0.063553,16.948200,Clean
22,AkRu08416224,2022-05-29 15:59:00,Clean Bacteria: E. coli,0.040670,27.080500,Clean
23,SoMa34205224,2022-07-31 13:25:00,Clean Bacteria: E. coli,0.072622,23.892000,Clean
24,KiIs23482224,2022-08-15 16:41:00,Clean Bacteria: E. coli,0.053914,41.084200,Clean
25,AmRu13252224,2022-08-20 14:23:00,Clean Bacteria: E. coli,0.065359,30.864300,Clean
26,KiRu27297224,2022-11-21 13:18:00,Clean Bacteria: E. coli,0.085684,8.625090,Clean
27,KiRu26929224,2022-12-18 10:52:00,Clean Bacteria: E. coli,0.074881,26.654100,Clean
28,HaAm16042224,2022-12-22 13:52:00,Clean Bacteria: E. coli,0.060577,4.547550,Clean
29,AkRu03107224,2023-01-01 15:37:00,Clean Bacteria: E. coli,0.090110,18.311800,Clean
30,KiHa23111224,2023-01-12 15:56:00,Clean Bacteria: E. coli,0.016187,36.874800,Clean
31,AkRu03771224,2023-02-26 12:40:00,Clean Bacteria: E. coli,0.062502,19.764800,Clean
32,AkRu04253224,2023-02-26 13:46:00,Clean Bacteria: E. coli,0.027381,3.088540,Clean
33,HaSe20949224,2023-04-03 16:26:00,Clean Bacteria: E. coli,0.045831,32.900400,Clean
34,KiAm22477224,2023-05-14 15:02:00,Clean Bacteria: E. coli,0.056817,25.658600,Clean
35,AkRu08365224,2023-05-28 14:56:00,Clean Bacteria: E. coli,0.082669,19.586000,Clean
36,AkRu04026224,2023-06-05 16:55:00,Clean Bacteria: E. coli,0.012489,22.948800,Clean
37,KiRu29194224,2023-06-08 09:28:00,Clean Bacteria: E. coli,0.050286,8.401460,Clean

In [36]:
# After running the update from CMD for to change Clean Bacteria: E. coli to just Bacteria: E. coli
df_4 = pd.read_sql_query("SELECT * FROM well_pollution WHERE description LIKE 'Clean%' AND biological > 0.01", ENGINE)
df_4

,source_id,date,description,pollutant_ppm,biological,results
0,AkRu06489224,2021-01-10 09:44:00,Clean Bacteria: Giardia Lamblia,0.089790,38.46700,Clean
1,KiRu25473224,2021-02-07 15:51:00,Clean Bacteria: Giardia Lamblia,0.063009,24.45360,Clean
2,HaRu17401224,2021-03-01 13:44:00,Clean Bacteria: Giardia Lamblia,0.064921,25.81290,Clean
3,AkRu07137224,2021-03-04 13:41:00,Clean Bacteria: Giardia Lamblia,0.065684,18.29780,Clean
4,KiRu27205224,2021-03-13 14:17:00,Clean Bacteria: Giardia Lamblia,0.041802,49.42810,Clean
5,AkHa00514224,2021-04-11 12:11:00,Clean Bacteria: Giardia Lamblia,0.030540,22.02550,Clean
6,AmAm09776224,2021-05-23 11:28:00,Clean Bacteria: Giardia Lamblia,0.096382,13.65740,Clean
7,SoIl32894224,2021-07-11 11:37:00,Clean Bacteria: Giardia Lamblia,0.071241,5.44957,Clean
8,AkRu07366224,2021-07-23 11:19:00,Clean Bacteria: Giardia Lamblia,0.096946,26.03080,Clean
9,KiHa23443224,2021-09-05 12:34:00,Clean Bacteria: Giardia Lamblia,0.082800,13.71620,Clean
10,AkRu06340224,2021-11-01 15:24:00,Clean Bacteria: Giardia Lamblia,0.051746,36.45940,Clean
11,AkRu06363224,2021-11-15 13:36:00,Clean Bacteria: Giardia Lamblia,0.088216,45.37310,Clean